#TODO Вместо запроса приказов отдельными дивизиями - общая оценка ситуации генералами и отдача приказов.
#TODO Проверка полками приказов на выполнимость.
#TODO Приказ невыполним. Что в этом случае делать солдатам?
#TODO Как определить случаи: движения навстречу, разминулись, погоня (один убегает, второй марширует), перекрытое отступление, взаимный отход?
#TODO Как будут себя вести в этих ситуациях солдаты?
#TODO А генералы? Какие приказы они будут отдавать?
#TODO Наращивание опыта при победе над врагом.
#TODO Понижение опыта при пополнении дивизии.
#TODO Критические потери, после которых солдаты уже не слушаются и бегут?
#TODO Как определить случай окружения полка с двух сторон?
#TODO Как будут поступать солдаты? А генералы?
#TODO Полк разбил своего противника. Какие будут приказы?
#TODO Бонус/потери от более широкого фронта, чем у вражеского полка?
#TODO Условия победы в битве - как их обобщить и где перечислить?
#TODO Два полка одной армии на одной стороне фронта. Как это определить?
#TODO Два полка одной армии на одной стороне фронта. Как определить их столкновение?
#TODO =/= Как они будут друг другу мешать и в чем?
#TODO Как вообще определить факт столкновения полков?
#TODO Могут ли полки проходить сквозь друг друга и при каких условиях? (Пример: одна армия, достаточный уровень опыта)
#TODO Условие победы: все полки противника разбиты.
#TODO Условие победы: =/=, сдались.
#TODO Условие победы: =/= или бежали за пределы поля боя.
#TODO Как ширина поля боя влияет на полки?
#TODO Предложение и организация полков по ширине/глубине/хвостам каждого полка каждой стороны.
#TODO Сдвигание полка врага при натиске назад (проминание фронта).
#TODO Обучение генералов маневрированию и оценке состояния всех полков (своих и чужих) при принятии решения.
#TODO Обучение генералов маневру "парфянская тактика": подбежать, обстрелять, отступить, повторить.
#TODO Обучение генералов маневру "обход с фланга": полк, разминувшийся с параллельным вражеским, смещается в бок для того, чтобы развернуться и нанести удар в тыл.
#TODO Обучение генералов маневру "уход с линии удара": если полк не уцелеет под ударом текущего противника, а параллельно свободно, полк смещается туда.
#TODO Обучение генералов маневру "ротация полков": два полка одной армии движутся сквозь друг друга, меняясь местами.
