#TODO BUG Осталось n солдат (в ключевом случае это была 1 амазонка) в полку и все! Противник лишь перегруппировывается, а победа ему не засчитывается. Поправить условия разгрома полков.
#TODO Далеко не всегда понятна причина победы. Добавить больше информации в лог.
#TODO Если было уничтожено не менее половины ряда, то до 2-3х человек могли взять в плен. Это отнести к потерям.
#TODO Изменить тексты части сообщений. Например: "(Генерал) потерял/-а (число) (вид войск) на (сторона) фронта" и "Броня сохранила солдат (генерала) на (сторона) фронте".

#TODO Вместо запроса приказов отдельными дивизиями - общая оценка ситуации генералами и отдача приказов.
#TODO Как определить случаи: движения навстречу, разминулись, погоня (один убегает, второй марширует), перекрытое отступление, взаимный отход?
#TODO Как будут себя вести в этих ситуациях солдаты?
#TODO А генералы? Какие приказы они будут отдавать?
#TODO Понижение опыта при пополнении дивизии.
#TODO Как определить случай окружения полка с двух сторон?
#TODO Как будут поступать солдаты? А генералы?
#TODO Полк разбил своего противника. Какие будут приказы?
#TODO Бонус/потери от более широкого фронта, чем у вражеского полка?
#TODO Условия победы в битве - как их обобщить и где перечислить?
#TODO Два полка одной армии на одной стороне фронта. Как это определить?
#TODO Два полка одной армии на одной стороне фронта. Как определить их столкновение?
#TODO =/= Как они будут друг другу мешать и в чем?
#TODO Могут ли полки проходить сквозь друг друга и при каких условиях? (Пример: одна армия, достаточный уровень опыта).
#TODO Как ширина поля боя влияет на полки?
#TODO Предложение и организация полков по ширине/глубине/хвостам каждого полка каждой стороны.
#TODO Сдвигание полка врага при натиске назад (проминание фронта).
#TODO Обучение генералов маневрированию и оценке состояния всех полков (своих и чужих) при принятии решения.
#TODO Обучение генералов маневру "парфянская тактика": подбежать, обстрелять, отступить, повторить.
#TODO Обучение генералов маневру "обход с фланга": полк, разминувшийся с параллельным вражеским, смещается в бок для того, чтобы развернуться и нанести удар в тыл.
#TODO Обучение генералов маневру "уход с линии удара": если полк не уцелеет под ударом текущего противника, а параллельно свободно, полк смещается туда.
#TODO Обучение генералов маневру "ротация полков": два полка одной армии движутся сквозь друг друга, меняясь местами.
#TODO Фланговый охват конницей: если в ближнем бою ширина конного отряда больше шиирины вражеского строя, то солдаты первой шеренги всадников, оказавшиеся на "полосах" по бокам, наносят дополнительный удар + бонус.


#TODO Чистые стрелки против чистых ближнебойных.
#TODO Универсальные бойцы.
